{
	"main": {
		"title": "Let's build something together",
		"subtitle": "A Front-End Web Developer",
		"description": "I'm a front-end web developer specializing in building and designing exceptional digital experiences. Currently, I'm focused on building responsive front-end web applications while learning Next.js, TypeScript and Solidity.",
		"salute": "Hi, I'm "
	},
	"about": {
		"title": "about",
		"subtitle": "Who I Am",
		"paragraph1": "Full Stack Web Developer, Builder Technical with a background in Architecture and a Blokchain technology enthusiast. I always found myself motivated and dedicated to develop, represent and execute solutions that responds to the needs people's with different degrees of scalability.",
		"paragraph2": "Briefly I would like to tell you that I have always been passionate about computers and communicating with a computer, I started as a child with maintenance, repairs and deployments in both software and hardware, I have gone through many technologies that I learned and linked me in the workplace and education, from there until today that I deepened this skill with programming oriented to web development, with which I have developed some projects (E-commerce, SPA).",
		"paragraph3": "Since I have always been interested in helping in the construction of knowledge in other people, I have 5 years of experience in the educational field where I taught 3 scientific and technical subjects, I was in charge of groups, implemented methodologies and provided tools to innovate the transmission of content."
	},
	"skills": {
		"title": "skills",
		"subtitle": "What I Can Do"
	},
	"projects": {
		"title": "projects",
		"subtitle": "What I've Built",
		"info": "More info",
		"overview": "Overview",
		"technologies": "Technologies",
		"ecommerce1": "The Pet Elegant website is a Single Page Application (SPA). It has a compact and clean design, is lightning fast and easily navigable. Since its target are people with love for their pets, who would like to put their dogs and cats at the center and as protagonists, with the care and respect they deserve. Therefore, the website seeks the satisfaction of both the Pet Lover and the pet.",
		"ecommerce2": "We successfully made an app with features for 3 different roles (Guest, User, Admin), integration with payment gateway, user registration or login with Google account, sending transactional emails, has a dashboard for managing users, orders, CRUD products.",
		"ecommerce3": "I was part of a team of 6 developers in charge of the production of an E-commerce as a final project for the SoyHenry bootcamp. Participation in an agile project, with Scrum methodology, presenting every week the progress of the app development.",
		"dogs1": "This project consisted in the development of a SPA (Single Page Application) made with React from the Client Side and Redux for state management, which consumes data provided from an API called 'The Dog API' and added new functionalities through the Server Side made with Node.js and Express.",
		"dogs2": "As features of the project we can find that it has, pagination that shows 8 different breeds of dogs per page, filters and sorting, pages with information for each breed, search by breed name (or similarities in the search), controlled form for the creation of new dogs and a mini navigation with the keyboard in the details of the breeds.",
		"nftdrop1": "This dApp or Decentralized Application consists of an easy and simple minting of characters from different NFT's collections on the Rinkeby network (Ethereum Blockchain tesnet), it was realized with Nextjs as React framework, Sanity as CMS for the data modeling and Thirweb for the connection with the Blockchain and the deployment of the smart contracts (ERC721 Standard).",
		"nftdrop2": "The dApp allows you to connect to Metamask via the Rinkeby network and claim collectible NFT's with Ethers as payment cryptocurrency. I took this project as an introduction to the TypeScript programming language.",
		"bonvo1": "Real Estate Web3 is an innovative Real Estate platform that utilizes blockchain technology to register and publish properties as NFTs on the Moonbeam network. The platform allows users to register and sign in with their wallet, which enables them to create a user account and use the platform as either a property owner/landlord or a tenant/renter.",
		"bonvo2": "A key feature of Real Estate Web3 is the ability to leave reviews stored on the blockchain, ensuring transparency and immutability of information. Additionally, users can locate the property by coordinates and use a GPS validation system to leave accurate reviews on-site.",
		"bonvo3": "The platform also features a secure payment system using smart contracts called Escrow, providing peace of mind and security for users when conducting transactions online. Additionally, users can claim an ERC20 reward token for contributing to the platform, either by leaving a review or publishing a property.",
		"taskhub1": "TaskHub is a web task management application that uses a Kanban board and a wide range of features to enhance team collaboration and productivity. With its focus on visualization and customization, TaskHub adapts to the specific needs of each team and helps them work more efficiently and effectively.",
		"taskhub2": "The application focuses on using a Kanban board to visually organize tasks in an easy-to-understand manner. The Kanban board is divided into columns representing different stages of the process, such as 'To-Do', 'In Progress', and 'Done'. Users can create and assign tasks in different columns and move them along the board as they progress through the process.",
		"taskhub3": "TaskHub is designed to be highly customizable and scalable. The application utilizes modern technologies such as TypeScript, Next.js, GraphQL, Prisma, Supabase, Redis, ChakraUI, and Framer Motion, allowing users to tailor the application to their specific needs and build large teams per project."
	},
	"contact": {
		"title": "Contact",
		"subtitle": "Get In Touch",
		"description": "I am available for freelance or full-time positions. Contact me and let's talk.",
		"connect": "Connect with me",
		"name": "name",
		"phone": "phone number",
		"subject": "subject",
		"message": "message",
		"send": "Send Message"
	},
	"footer": {
		"made": "Made with ❤ by Matias Palomo"
	}
}
